In [1]:
import pandas as pd

# When data is arranged in columns

In [2]:
names=['Harshit','Mohit','Nitish']
hobbies=['coding','pc games','pc games']
height=['175 cm','170 cm','170 cm']

In [4]:
information=pd.DataFrame({'Name':names,'Hobbies':hobbies,'height':height})

In [5]:
information

      Name   Hobbies  height
0  Harshit    coding  175 cm
1    Mohit  pc games  170 cm
2   Nitish  pc games  170 cm

In [6]:
information.set_index('Name',inplace=True)

In [7]:
information

          Hobbies  height
Name
Harshit    coding  175 cm
Mohit    pc games  170 cm
Nitish   pc games  170 cm

# When data is arranged in rows

In [8]:
row1=['Harshit','Coding','175 cm']
row2=['Nitish','pc games','170 cm']
row3=['Mohit','pc games','170 cm']

In [9]:
info2=pd.DataFrame(data=[row1,row2,row3],columns=['Names','Hobbies','Height'])

In [10]:
info2

     Names   Hobbies  Height
0  Harshit    Coding  175 cm
1   Nitish  pc games  170 cm
2    Mohit  pc games  170 cm

In [11]:
info2.set_index('Names',inplace=True)

In [12]:
info2

          Hobbies  Height
Names
Harshit    Coding  175 cm
Nitish   pc games  170 cm
Mohit    pc games  170 cm

In [14]:
ser=pd.Series(data=hobbies)

In [15]:
ser

0      coding
1    pc games
2    pc games
dtype: object

In [17]:
ser.to_frame()

          0
0    coding
1  pc games
2  pc games

In [18]:
df=ser=pd.Series(data=hobbies).to_frame()

In [19]:
df

          0
0    coding
1  pc games
2  pc games

In [20]:
df=ser=pd.Series(data=hobbies,name='Hobbies').to_frame()
df

    Hobbies
0    coding
1  pc games
2  pc games

In [21]:
df['height']=height

In [22]:
df

    Hobbies  height
0    coding  175 cm
1  pc games  170 cm
2  pc games  170 cm